Autodesk.Revit.DB.MEPSystemClassification
Since:
2012
This enumeration is used to classify MEP connectors and systems
and drives certain behavior for a particular system type
Since:
2012

Autodesk.Revit.DB.MEPSystemClassification.CableTrayConduit
Indicates the default type for cable trays and conduits

Autodesk.Revit.DB.MEPSystemClassification.PowerUnBalanced
Equivalent with PowerCircuit

Autodesk.Revit.DB.MEPSystemClassification.PowerBalanced
Equivalent with PowerCircuit

Autodesk.Revit.DB.MEPSystemClassification.Global
Reserved for application usage, used for UI filtering in Family Editor

Autodesk.Revit.DB.MEPSystemClassification.Fitting
Reserved for application usage, used for UI filtering in Family Editor

Autodesk.Revit.DB.MEPSystemClassification.SwitchTopology
An electrical switch system

Autodesk.Revit.DB.MEPSystemClassification.FireProtectOther
A user defined fire protection system

Autodesk.Revit.DB.MEPSystemClassification.FireProtectPreaction
A preaction fire protection system

Autodesk.Revit.DB.MEPSystemClassification.FireProtectDry
A dry fire protection system

Autodesk.Revit.DB.MEPSystemClassification.FireProtectWet
A wet fire protection system

Autodesk.Revit.DB.MEPSystemClassification.OtherPipe
An user classified piping system

Autodesk.Revit.DB.MEPSystemClassification.Recirculation
Reserved for future use

Autodesk.Revit.DB.MEPSystemClassification.DomesticColdWater
A cold water piping system

Autodesk.Revit.DB.MEPSystemClassification.DomesticHotWater
A hot water piping system

Autodesk.Revit.DB.MEPSystemClassification.Storm
Reserved for future use

Autodesk.Revit.DB.MEPSystemClassification.Vent
A piping ventilation system

Autodesk.Revit.DB.MEPSystemClassification.Sanitary
A sanitary piping system

Autodesk.Revit.DB.MEPSystemClassification.CondensateDrain
Reserved for future use

Autodesk.Revit.DB.MEPSystemClassification.Communication
An electrical circuit classified as communication

Autodesk.Revit.DB.MEPSystemClassification.Controls
An electrical circuit classified as controls

Autodesk.Revit.DB.MEPSystemClassification.NurseCall
An electrical circuit classified as nurse call

Autodesk.Revit.DB.MEPSystemClassification.FireAlarm
An electrical fire alarm circuit

Autodesk.Revit.DB.MEPSystemClassification.Security
An electrical security circuit

Autodesk.Revit.DB.MEPSystemClassification.Telephone
An electrical circuit classified as telephone

Autodesk.Revit.DB.MEPSystemClassification.ReturnHydronic
A hydronic return piping system

Autodesk.Revit.DB.MEPSystemClassification.SupplyHydronic
A hydronic supply piping system

Autodesk.Revit.DB.MEPSystemClassification.PowerCircuit
An electrical circuit

Autodesk.Revit.DB.MEPSystemClassification.DataCircuit
An electrical data circuit

Autodesk.Revit.DB.MEPSystemClassification.OtherAir
An user classified air duct system

Autodesk.Revit.DB.MEPSystemClassification.ExhaustAir
Obsolete classification not used anymore

Autodesk.Revit.DB.MEPSystemClassification.ReturnAir
A return air duct system

Autodesk.Revit.DB.MEPSystemClassification.SupplyAir
A supply air duct system

Autodesk.Revit.DB.MEPSystemClassification.UndefinedSystemClassification
A system classification not yet defined